# Table 3
This notebook produces the data for "Table 3. Average Number of Jobs Accessible via Transit" in the paper.

In [1]:
#Import packages
import pandas as pd
import matplotlib as mpl
#import matplotlib.pyplot as plt
import numpy as np
import math
import os
pd.options.mode.chained_assignment = None #gets rid of warning for chained alterations

In [2]:
#set directories
os.chdir("/Users/briangoggin/Dropbox/CP 201A/Fruitvale")
cwd = os.getcwd()
root = cwd #root is directory to raw files

# Section 1. Accessibility Table

In [3]:
#import data
input_data = root+"/Output/fulltransit_26minute_accessibility.csv"
df = pd.read_csv(input_data)

In [4]:
#Drop unneeded variables
list = ['high_jobs_26', 'low_jobs_26', 'middle_jobs_26', 'total_jobs_26', 'block_id']
df = df[list]
df.head()

   high_jobs_26  low_jobs_26  middle_jobs_26  total_jobs_26        block_id
0            22           16               7             45  60014001001007
1            18            3               5             26  60014001001008
2            28           16               8             52  60014001001017
3             7            9               6             22  60014001001024
4            24           19              19             62  60014001001026

In [5]:
Fruitvale = [6001406100, 6001406201, 6001406202, 6001406300, 6001406500, 6001407101, 6001407102, 6001407200, 6001407300, 6001407400, 6001407500, 6001407600]
df['tract'] = df['block_id'].astype(str).str[0:10]
df['Fruitvale'] = df['tract'].astype(int).isin(Fruitvale)
df.head()

,high_jobs_26,low_jobs_26,middle_jobs_26,total_jobs_26,block_id,tract,Fruitvale
0,22,16,7,45,60014001001007,6001400100,False
1,18,3,5,26,60014001001008,6001400100,False
2,28,16,8,52,60014001001017,6001400100,False
3,7,9,6,22,60014001001024,6001400100,False
4,24,19,19,62,60014001001026,6001400100,False

In [6]:
#add duplicate observations for Fruitvale before collapsing to the average
df2 = df[df['Fruitvale']==True]
df2['Fruitvale'] = False
df = df.append(df2)
df.head()

,high_jobs_26,low_jobs_26,middle_jobs_26,total_jobs_26,block_id,tract,Fruitvale
0,22,16,7,45,60014001001007,6001400100,False
1,18,3,5,26,60014001001008,6001400100,False
2,28,16,8,52,60014001001017,6001400100,False
3,7,9,6,22,60014001001024,6001400100,False
4,24,19,19,62,60014001001026,6001400100,False

In [7]:
#test to make sure Fruitvale Duplicates were added
df[df['block_id'] == 60014063001000]

,high_jobs_26,low_jobs_26,middle_jobs_26,total_jobs_26,block_id,tract,Fruitvale
2039,140798,62501,80575,283874,60014063001000,6001406300,True
2039,140798,62501,80575,283874,60014063001000,6001406300,False

In [8]:
varlist =[ 'total_jobs_26','high_jobs_26','middle_jobs_26', 'low_jobs_26']
exdf = df.groupby(['Fruitvale'])[varlist].mean()
exdf.head()

           total_jobs_26  high_jobs_26  middle_jobs_26  low_jobs_26
Fruitvale
False             169290         84194           47931        37164
True              245818        121979           69648        54191

In [9]:
#Reorder, Reshape, and export data
exdf = exdf.transpose()
export_path = root+"/Output/python_output"
exdf.to_csv(export_path+"/acc_comparison_full.csv")